# Functional requirements:
### 1. Создать таблицы БД с учетом ограничений целостности данных.
### 2. Используя оператор Select, выдать следующую информацию:
- по каждому вертолету – общее количество часов, которые они налетали после капитального ремонта, и ресурс летного времени (*); 15 
- по каждому вертолету – перечень выполненных рейсов с указанием общей массы перевезенных грузов и количества человек за указанный период(*);
- по всем вертолетам, выполнявшим спецрейсы, – общее количество рейсов, общая масса перевезенных грузов, общая сумма заработанных денег;
- по всем вертолетам, выполнявшим обычные рейсы, – общее количество рейсов, общая масса перевезенных грузов, общая сумма заработанных денег;
- по вертолету, выполнившему максимальное количество рейсов, – все сведения об его экипаже и количестве заработанных денег;
- по экипажу, заработавшему максимальное количество денег, – все сведения о выполненных им рейсах.
- по экипажу(или члену экипажа), – все сведения о выполненных им рейсах (*).
### 3. Обеспечить: 
С помощью операторов Insert, Update, Delete обновление информации в указанных таблицах.
### 4. Создать функцию: 
которая при внесении информации в таблицу рейсов, проверяет, не будет ли превышен ресурс летного времени для вертолета, и если это так, то запрещает вносить информацию в таблицу.
### 5. Создать функцию:
Которая за указанный период определяет количество денег, начисленных экипажам авиаотряда за перевозки. В качестве параметра передать начальную дату периода и конечную дату периода. Результаты занести в специальную таблицу.
### 6. Создать функцию:
Которая за указанный период определяет количество денег, начисленных указанному летчику(*).
### 7. Создать функцию: 
Которая за указанный период определяет количество денег, начисленных указанному летчику за указанный рейс(сы) или спецрейс(сы) (*).
